L=1;% длина струны 
Vvoln=1;% скорость распространения волны 
Vist=1;% скорость источника 
N=1000;% количество точек разбиения 
dx=L/N;% длина малого участка 
% вводятся начальные условия 
for k=1:(N+1);% открытие цикла по точкам струны 
    x(k)=dx.*(k-1);% координаты точек струны 
    u(k)=0.01-(L/2-x(k))^2;% начальное положение 
    v(k)=0;% начальная скорость    
    a(k)=0;% начальное ускорение (вводится для удобства работы программы) 
end;  
dt=0.001;% малый промежуток времени 
T=1;% время расчета 
% вычисление по методу Эйлера 
for t=dt:dt:T; 
    for k=2:1:N; 
          if  abs(L/2-x(k))<0.1; 
              f(k)=0.01-((L/2)-x(k))^2;%  функция  источника 
          else f(k)=0; end; 
          % применение метода конечных разностей 
          a(k)=Vvoln.^2.*(u(k+1)-2.*u(k)+u(k-1))./dx.^2+f(k);%  ускорение 
    end; 
    v=v+a.*dt;% скорости  точек струны 
    u=u+v.*dt; % положения  точек струны 
    % указываются граничные условия 
    u(1)=u(2);%  левый конец струны       
    u(N+1)=u(N);% правый конец струны  
    plot(x,u)  % построение графика  
    axis([0 1 -0.3 0.1]);% установление границ графика 
    pause(0);% исключить паузу между кадрами 
end; % конец цикла по времени 
