L1=10;
L2=10;% длины сторон прямоугольной мембраны  
N1=80;
N2=80; % количество точек разбиения 
dx=L1/N1; 
dy=L2/N2; % длины сторон малых прямоугольников 
Vvoln=1;% скорость распространения волны 
%задание начальных условий 
for i=1:(N1+1);% разбиение вдоль оси ОХ 
    x(i)=-L1/2+dx*(i-1);% абсциссы точек мембраны 
    for j=1:(N2+1);% разбиение вдоль оси ОУ 
        y(j)=-L2/2+dy*(j-1);% координаты точек мембраны 
        if  16*x(i)^2+y(j)^2<1;  %  задание  начального  положения мембраны 
            u(i,j)=1-16*x(i)^2-y(j)^2; 
        else u(i,j)=0; 
        end; 
        v(i,j)=0;% задание начальной скорости мембраны  
    end; 
end; 
T=2; % время расчета 
dt=0.01;% малый промежуток времени 
%применение метода Эйлера к точкам мембраны 
for t=0:dt:T; 
    a=Vvoln^2*del2(u,dx,dy);% вычисление ускорения из волнового уравнения 
    v=v+a*dt;% вычисление скорости 
    u=u+v*dt;% вычисление отклонения точек мембраны 
    [X,Y]=meshgrid(-L1/2:dx:L1/2,-L2/2:dy:L2/2); % область определения 
    contour(X,Y,u);% построение поверхности 
    axis([-L1/2 L1/2 -L2/2 L2/2 -1 1]);% установление границ графика 
    pause(0);% исключить паузу между кадрами 
end;  