alfa=pi/2; %   угол, под которым влетает частица    
q=2;  %   заряд частицы  
B= [3 0 0];  %  вектор индукции магнитного поля 
m=1;  %    масса частицы  
r= [0 0 0]; %  начальный радиус-вектор   
v= [1*cos(alfa) 1*sin(alfa) 0];  %    вектор начальной скорости 
X= [];   %  открытие массива для запоминания  координаты X 
Y= []; % %  открытие массива для запоминания координаты Y 
Z= []; % %  открытие массива для запоминания координаты Z 
T=10; % время  расчета  
dt=0.001;  %   шаг во времени 
for t=0:dt:T;  %  открытие цикла по времени 
    X=[X   r(1)]; % запись в массив координаты X   
    Y=[Y   r(2)]; %  запись в массив координаты Y 
    Z=[Z   r(3)];  % запись в массив  координаты Z 
    F=q* cross (v,B); %  сила Лоренца, cross- векторное произведение 
    a=F/m;  %  вектор ускорения 
    v=v+a*dt;  %   скорость через малый промежуток времени dt 
    r=r+v*dt;    %    радиус-вектор  через  малый  промежуток  времени dt 
end;  % закрытие цикла по времени 
plot3(X,Y,Z)  % построение трехмерного графика 
grid  %  дополнительная строка, строит сетку 
