CODE SEGMENT		; Определение программного сегмента      
    ORG 100h        ; (a - b * (c - d)) / 4
	ASSUME DS:CODE
Start:					; Точка входа в программу
MOV AX, c			; Запись в AX значения переменной c
MOV BX, b			;Запись в BX значения переменной b
SUB AX, d			; Вычитание из AX d
IMUL BX			; Умножение АХ на ВХ      
MOV BX, a            ; Запись а в ВХ
SUB BX, AX           ; вычитание из ВХ АХ
MOV ax, BX           ; Запись числа из ВХ в АХ
IDIV H				; Деление АХ на Н	
MOV k, AX		; Запись значения AX в переменную k
	INT 21h			; Вызов функции DOS завершения 

a	DW	39			; определение переменной a
b	DW	5			; определение переменной b
c	DW	7			; определение переменной c
d	DW	3			; определение переменной d    
H   DW  4
K	DW	?
CODE ENDS			; конец программного сегмента
	END Start			; определение точки входа в программу



